tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register>
          <name>FGPFCCR</name>
          <displayName>FGPFCCR</displayName>
          <description>DMA2D foreground PFC control
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>Color mode These bits defines the color
              format of the foreground image. They can only be
              written when data transfers are disabled. Once the
              transfer has started, they are read-only. others:
              meaningless</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues><name>CM</name><usage>read-write</usage><enumeratedValue><name>ARGB8888</name><description>Color mode ARGB8888</description><value>0</value></enumeratedValue><enumeratedValue><name>RGB888</name><description>Color mode RGB888</description><value>1</value></enumeratedValue><enumeratedValue><name>RGB565</name><description>Color mode RGB565</description><value>2</value></enumeratedValue><enumeratedValue><name>ARGB1555</name><description>Color mode ARGB1555</description><value>3</value></enumeratedValue><enumeratedValue><name>ARGB4444</name><description>Color mode ARGB4444</description><value>4</value></enumeratedValue><enumeratedValue><name>L8</name><description>Color mode L8</description><value>5</value></enumeratedValue><enumeratedValue><name>AL44</name><description>Color mode AL44</description><value>6</value></enumeratedValue><enumeratedValue><name>AL88</name><description>Color mode AL88</description><value>7</value></enumeratedValue><enumeratedValue><name>L4</name><description>Color mode L4</description><value>8</value></enumeratedValue><enumeratedValue><name>A8</name><description>Color mode A8</description><value>9</value></enumeratedValue><enumeratedValue><name>A4</name><description>Color mode A4</description><value>10</value></enumeratedValue><enumeratedValue><name>YCbCr</name><description>Color mode YCbCr</description><value>11</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT color mode This bit defines the
              color format of the CLUT. It can only be written when
              the transfer is disabled. Once the CLUT transfer has
              started, this bit is read-only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CCM</name><usage>read-write</usage><enumeratedValue><name>ARGB8888</name><description>CLUT color format ARGB8888</description><value>0</value></enumeratedValue><enumeratedValue><name>RGB888</name><description>CLUT color format RGB888</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start This bit can be set to start the
              automatic loading of the CLUT. It is automatically
              reset: ** at the end of the transfer ** when the
              transfer is aborted by the user application by
              setting the ABORT bit in DMA2D_CR ** when a transfer
              error occurs ** when the transfer has not started due
              to a configuration error or another transfer
              operation already ongoing (data transfer or automatic
              background CLUT transfer).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>START</name><usage>read-write</usage><enumeratedValue><name>Start</name><description>Start the automatic loading of the CLUT</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size These bits define the size of
              the CLUT used for the foreground image. Once the CLUT
              transfer has started, this field is read-only. The
              number of CLUT entries is equal to CS[7:0] +
              1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode These bits select the alpha
              channel value to be used for the foreground image.
              They can only be written data the transfer are
              disabled. Once the transfer has started, they become
              read-only. other configurations are
              meaningless</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>AM</name><usage>read-write</usage><enumeratedValue><name>NoModify</name><description>No modification of alpha channel</description><value>0</value></enumeratedValue><enumeratedValue><name>Replace</name><description>Replace with value in ALPHA[7:0]</description><value>1</value></enumeratedValue><enumeratedValue><name>Multiply</name><description>Multiply with value in ALPHA[7:0]</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CSS</name>
              <description>Chroma Sub-Sampling These bits define
              the chroma sub-sampling mode for YCbCr color mode.
              Once the transfer has started, these bits are
              read-only. others: meaningless</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha Inverted This bit inverts the
              alpha value. Once the transfer has started, this bit
              is read-only.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AI</name><usage>read-write</usage><enumeratedValue><name>RegularAlpha</name><description>Regular alpha</description><value>0</value></enumeratedValue><enumeratedValue><name>InvertedAlpha</name><description>Inverted alpha</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RBS</name>
              <description>Red Blue Swap This bit allows to swap
              the R &amp;amp; B to support BGR or ABGR color
              formats. Once the transfer has started, this bit is
              read-only.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RBS</name><usage>read-write</usage><enumeratedValue><name>Regular</name><description>No Red Blue Swap (RGB or ARGB)</description><value>0</value></enumeratedValue><enumeratedValue><name>Swap</name><description>Red Blue Swap (BGR or ABGR)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value These bits define a fixed
              alpha channel value which can replace the original
              alpha value or be multiplied by the original alpha
              value according to the alpha mode selected through
              the AM[1:0] bits. These bits can only be written when
              data transfers are disabled. Once a transfer has
              started, they become read-only.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCOLR</name>
          <displayName>FGCOLR</displayName>
          <description>DMA2D foreground color
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Blue Value These bits defines the blue
              value for the A4 or A8 mode of the foreground image.
              They can only be written when data transfers are
              disabled. Once the transfer has started, They are
              read-only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green Value These bits defines the green
              value for the A4 or A8 mode of the foreground image.
              They can only be written when data transfers are
              disabled. Once the transfer has started, They are
              read-only.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>RED</name>
              <description>Red Value These bits defines the red
              value for the A4 or A8 mode of the foreground image.
              They can only be written when data transfers are
              disabled. Once the transfer has started, they are
              read-only.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BGPFCCR</name>
          <displayName>BGPFCCR</displayName>
          <description>DMA2D background PFC control
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CM</name>
              <description>Color mode These bits define the color
              format of the foreground image. These bits can only
              be written when data transfers are disabled. Once the
              transfer has started, they are read-only. others:
              meaningless</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues><name>CM</name><usage>read-write</usage><enumeratedValue><name>ARGB8888</name><description>Color mode ARGB8888</description><value>0</value></enumeratedValue><enumeratedValue><name>RGB888</name><description>Color mode RGB888</description><value>1</value></enumeratedValue><enumeratedValue><name>RGB565</name><description>Color mode RGB565</description><value>2</value></enumeratedValue><enumeratedValue><name>ARGB1555</name><description>Color mode ARGB1555</description><value>3</value></enumeratedValue><enumeratedValue><name>ARGB4444</name><description>Color mode ARGB4444</description><value>4</value></enumeratedValue><enumeratedValue><name>L8</name><description>Color mode L8</description><value>5</value></enumeratedValue><enumeratedValue><name>AL44</name><description>Color mode AL44</description><value>6</value></enumeratedValue><enumeratedValue><name>AL88</name><description>Color mode AL88</description><value>7</value></enumeratedValue><enumeratedValue><name>L4</name><description>Color mode L4</description><value>8</value></enumeratedValue><enumeratedValue><name>A8</name><description>Color mode A8</description><value>9</value></enumeratedValue><enumeratedValue><name>A4</name><description>Color mode A4</description><value>10</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT Color mode These bits define the
              color format of the CLUT. This register can only be
              written when the transfer is disabled. Once the CLUT
              transfer has started, this bit is
              read-only.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CCM</name><usage>read-write</usage><enumeratedValue><name>ARGB8888</name><description>CLUT color format ARGB8888</description><value>0</value></enumeratedValue><enumeratedValue><name>RGB888</name><description>CLUT color format RGB888</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start This bit is set to start the
              automatic loading of the CLUT. This bit is
              automatically reset: ** at the end of the transfer **
              when the transfer is aborted by the user application
              by setting the ABORT bit in the DMA2D_CR ** when a
              transfer error occurs ** when the transfer has not
              started due to a configuration error or another
              transfer operation already on going (data transfer or
              automatic BackGround CLUT transfer).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>START</name><usage>read-write</usage><enumeratedValue><name>Start</name><description>Start the automatic loading of the CLUT</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size These bits define the size of
              the CLUT used for the BG. Once the CLUT transfer has
              started, this field is read-only. The number of CLUT
              entries is equal to CS[7:0] + 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode These bits define which alpha
              channel value to be used for the background image.
              These bits can only be written when data transfers
              are disabled. Once the transfer has started, they are
              read-only. others: meaningless</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>AM</name><usage>read-write</usage><enumeratedValue><name>NoModify</name><description>No modification of alpha channel</description><value>0</value></enumeratedValue><enumeratedValue><name>Replace</name><description>Replace with value in ALPHA[7:0]</description><value>1</value></enumeratedValue><enumeratedValue><name>Multiply</name><description>Multiply with value in ALPHA[7:0]</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AI</name>
              <description>Alpha Inverted This bit inverts the
              alpha value. Once the transfer has started, this bit
              is read-only.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AI</name><usage>read-write</usage><enumeratedValue><name>RegularAlpha</name><description>Regular alpha</description><value>0</value></enumeratedValue><enumeratedValue><name>InvertedAlpha</name><description>Inverted alpha</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RBS</name>
              <description>Red Blue Swap This bit allows to swap
              the R &amp;amp; B to support BGR or ABGR color
              formats. Once the transfer has started, this bit is
              read-only.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RBS</name><usage>read-write</usage><enumeratedValue><name>Regular</name><description>No Red Blue Swap (RGB or ARGB)</description><value>0</value></enumeratedValue><enumeratedValue><name>Swap</name><description>Red Blue Swap (BGR or ABGR)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value These bits define a fixed
              alpha channel value which can replace the original
              alpha value or be multiplied with the original alpha
              value according to the alpha mode selected with bits
              AM[1: 0]. These bits can only be written when data
              transfers are disabled. Once the transfer has
              started, they are read-only.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCOLR</name>
          <displayName>BGCOLR</displayName>
          <description>DMA2D background color
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Blue Value These bits define the blue
              value for the A4 or A8 mode of the background. These
              bits can only be written when data transfers are
              disabled. Once the transfer has started, they are
              read-only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>GREEN</name>
              <description>Green Value These bits define the green
              value for the A4 or A8 mode of the background. These
              bits can only be written when data transfers are
              disabled. Once the transfer has started, they are
              read-only.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>RED</name>
              <description>Red Value These bits define the red
              value for the A4 or A8 mode of the background. These
              bits can only be written when data transfers are
              disabled. Once the transfer has started, they are
              read-only.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCMAR</name>
          <displayName>FGCMAR</displayName>
          <description>DMA2D foreground CLUT memory address
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address Address of the data used
              for the CLUT address dedicated to the foreground
              image. This register can only be written when no
              transfer is ongoing. Once the CLUT transfer has
              started, this register is read-only. If the
              foreground CLUT format is 32-bit, the address must be
              32-bit aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCMAR</name>
          <displayName>BGCMAR</displayName>
          <description>DMA2D background CLUT memory address
          register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Address of the data used
              for the CLUT address dedicated to the background
              image. This register can only be written when no
              transfer is on going. Once the CLUT transfer has
              started, this register is read-only. If the
              background CLUT format is 32-bit, the address must be
              32-bit aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
