tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>GPIO port output data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ODR0</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ODR0</name><usage>read-write</usage><enumeratedValue><name>High</name><description>Set output to logic high</description><value>1</value></enumeratedValue><enumeratedValue><name>Low</name><description>Set output to logic low</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ODR1</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR2</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR3</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR4</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR5</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR6</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR7</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR8</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR9</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR10</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR11</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR12</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR13</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR14</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
            <field>
              <name>ODR15</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ODR0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>GPIO port bit set/reset
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BS0</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BS0W</name><usage>write</usage><enumeratedValue><name>Set</name><description>Sets the corresponding ODRx bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS8</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS9</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS10</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS11</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS12</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS13</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS14</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS15</name>
              <description>Port x set bit y (y= 0..15) These bits
              are write-only. A read to these bits returns the
              value 0x0000.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BR0</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>BR0W</name><usage>write</usage><enumeratedValue><name>Reset</name><description>Resets the corresponding ODRx bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset bit y (y = 0..15) These
              bits are write-only. A read to these bits returns the
              value 0x0000. Note: If both BSx and BRx are set, BSx
              has priority.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="BR0W"/>
            </field>
          </fields>
        </register>
