tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register>
          <name>BKP14R</name>
          <displayName>BKP14R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP15R</name>
          <displayName>BKP15R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <displayName>OR</displayName>
          <description>RTC option register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC_ALARM_TYPE</name>
              <description>RTC_ALARM output type on
              PC13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC_OUT_RMP</name>
              <description>RTC_OUT remap</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP16R</name>
          <displayName>BKP16R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP17R</name>
          <displayName>BKP17R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP18R</name>
          <displayName>BKP18R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP19R</name>
          <displayName>BKP19R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP20R</name>
          <displayName>BKP20R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP21R</name>
          <displayName>BKP21R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP22R</name>
          <displayName>BKP22R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP23R</name>
          <displayName>BKP23R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP24R</name>
          <displayName>BKP24R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP25R</name>
          <displayName>BKP25R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP26R</name>
          <displayName>BKP26R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP27R</name>
          <displayName>BKP27R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP28R</name>
          <displayName>BKP28R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP29R</name>
          <displayName>BKP29R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP30R</name>
          <displayName>BKP30R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP31R</name>
          <displayName>BKP31R</displayName>
          <description>RTC backup registers</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKP</name>
              <description>The application can write or read data
              to and from these registers. They are powered-on by
              VBAT when VDD is switched off, so that they are not
              reset by System reset, and their contents remain
              valid when the device operates in low-power mode.
              This register is reset on a tamper detection event,
              as long as TAMPxF=1. or when the Flash readout
              protection is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
