tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00001002</resetValue>
          <fields>
            <field>
              <name>CTSIZE</name>
              <description>Number of data frames remaining in
              current TSIZE session</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>RXWNE</name>
              <description>RxFIFO Word Not Empty</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXWNE</name><usage>read-write</usage><enumeratedValue><name>LessThan32</name><description>Less than 32-bit data frame received</description><value>0</value></enumeratedValue><enumeratedValue><name>AtLeast32</name><description>At least 32-bit data frame received</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXPLVL</name>
              <description>RxFIFO Packing LeVeL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>RXPLVL</name><usage>read-write</usage><enumeratedValue><name>ZeroFrames</name><description>Zero frames beyond packing ratio available</description><value>0</value></enumeratedValue><enumeratedValue><name>OneFrame</name><description>One frame beyond packing ratio available</description><value>1</value></enumeratedValue><enumeratedValue><name>TwoFrames</name><description>Two frame beyond packing ratio available</description><value>2</value></enumeratedValue><enumeratedValue><name>ThreeFrames</name><description>Three frame beyond packing ratio available</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXC</name>
              <description>TxFIFO transmission
              complete</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXC</name><usage>read-write</usage><enumeratedValue><name>Ongoing</name><description>Transmission ongoing</description><value>0</value></enumeratedValue><enumeratedValue><name>Completed</name><description>Transmission completed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SUSP</name>
              <description>SUSPend</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SUSP</name><usage>read-write</usage><enumeratedValue><name>NotSuspended</name><description>Master not suspended</description><value>0</value></enumeratedValue><enumeratedValue><name>Suspended</name><description>Master suspended</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSERF</name>
              <description>Additional number of SPI data to be
              transacted was reload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TSERF</name><usage>read-write</usage><enumeratedValue><name>NotLoaded</name><description>Additional number of SPI data to be transacted not yet loaded</description><value>0</value></enumeratedValue><enumeratedValue><name>Loaded</name><description>Additional number of SPI data to be transacted was reloaded</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MODF</name>
              <description>Mode Fault</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MODF</name><usage>read-write</usage><enumeratedValue><name>NoFault</name><description>No mode fault detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Fault</name><description>Mode fault detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TIFRE</name>
              <description>TI frame format error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TIFRE</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>TI frame format error detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>TI frame format error detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CRCE</name>
              <description>CRC Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CRCE</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No CRC error detected</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>CRC error detected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVR</name><usage>read-write</usage><enumeratedValue><name>NoOverrun</name><description>No overrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UDR</name>
              <description>Underrun at slave transmission
              mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UDR</name><usage>read-write</usage><enumeratedValue><name>NoUnderrun</name><description>No underrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Underrun</name><description>Underrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXTF</name>
              <description>Transmission Transfer
              Filled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXTF</name><usage>read-write</usage><enumeratedValue><name>NotCompleted</name><description>Transmission buffer incomplete</description><value>0</value></enumeratedValue><enumeratedValue><name>Completed</name><description>Transmission buffer filled with at least one transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOT</name>
              <description>End Of Transfer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOT</name><usage>read-write</usage><enumeratedValue><name>NotCompleted</name><description>Transfer ongoing or not started</description><value>0</value></enumeratedValue><enumeratedValue><name>Completed</name><description>Transfer complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DXP</name>
              <description>Duplex Packet</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DXP</name><usage>read-write</usage><enumeratedValue><name>Unavailable</name><description>Duplex packet unavailable: no space for transmission and/or no data received</description><value>0</value></enumeratedValue><enumeratedValue><name>Available</name><description>Duplex packet available: space for transmission and data received</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXP</name>
              <description>Tx-Packet space available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXP</name><usage>read-write</usage><enumeratedValue><name>Full</name><description>Tx buffer full</description><value>0</value></enumeratedValue><enumeratedValue><name>NotFull</name><description>Tx buffer not full</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXP</name>
              <description>Rx-Packet available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXP</name><usage>read-write</usage><enumeratedValue><name>Empty</name><description>Rx buffer empty</description><value>0</value></enumeratedValue><enumeratedValue><name>NotEmpty</name><description>Rx buffer not empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>Interrupt/Status Flags Clear
          Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUSPC</name>
              <description>SUSPend flag clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>TSERFC</name>
              <description>TSERFC flag clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>MODFC</name>
              <description>Mode Fault flag clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>TIFREC</name>
              <description>TI frame format error flag
              clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>CRCEC</name>
              <description>CRC Error flag clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>OVRC</name>
              <description>Overrun flag clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>UDRC</name>
              <description>Underrun flag clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>TXTFC</name>
              <description>Transmission Transfer Filled flag
              clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOTCW"/>
            </field>
            <field>
              <name>EOTC</name>
              <description>End Of Transfer flag clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOTCW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clear interrupt flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR</name>
          <displayName>TXDR</displayName>
          <description>Transmit Data Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDR</name>
              <description>Transmit data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDR</name>
          <displayName>RXDR</displayName>
          <description>Receive Data Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXDR</name>
              <description>Receive data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <displayName>CRCPOLY</displayName>
          <description>Polynomial Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000107</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCRC</name>
          <displayName>TXCRC</displayName>
          <description>Transmitter CRC Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXCRC</name>
              <description>CRC register for
              transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRC</name>
          <displayName>RXCRC</displayName>
          <description>Receiver CRC Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>CRC register for receiver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UDRDR</name>
          <displayName>UDRDR</displayName>
          <description>Underrun Data Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UDRDR</name>
              <description>Data at slave underrun
              condition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
