tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register>
          <name>D3PCR1H</name>
          <displayName>D3PCR1H</displayName>
          <description>EXTI D3 pending clear selection register
          high</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS19</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+32)/2)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PCS19</name><usage>read-write</usage><enumeratedValue><name>DMA_CH6</name><description>DMA ch6 event selected as D3 domain pendclear source</description><value>0</value></enumeratedValue><enumeratedValue><name>DMA_CH7</name><description>DMA ch7 event selected as D3 domain pendclear source</description><value>1</value></enumeratedValue><enumeratedValue><name>LPTIM4</name><description>LPTIM4 out selected as D3 domain pendclear source</description><value>2</value></enumeratedValue><enumeratedValue><name>LPTIM5</name><description>LPTIM5 out selected as D3 domain pendclear source</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCS20</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+32)/2)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS19"/>
            </field>
            <field>
              <name>PCS21</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+32)/2)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS19"/>
            </field>
            <field>
              <name>PCS25</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+32)/2)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS19"/>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR2</name>
          <displayName>RTSR2</displayName>
          <description>EXTI rising trigger selection
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR49</name>
              <description>Rising trigger event configuration bit
              of Configurable Event input x+32</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TR49</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Rising edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Rising edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TR51</name>
              <description>Rising trigger event configuration bit
              of Configurable Event input x+32</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR49"/>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR2</name>
          <displayName>FTSR2</displayName>
          <description>EXTI falling trigger selection
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR49</name>
              <description>Falling trigger event configuration bit
              of Configurable Event input x+32</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TR49</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Falling edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Falling edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TR51</name>
              <description>Falling trigger event configuration bit
              of Configurable Event input x+32</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR49"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER2</name>
          <displayName>SWIER2</displayName>
          <description>EXTI software interrupt event
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWIER49</name>
              <description>Software interrupt on line
              x+32</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SWIER49W</name><usage>write</usage><enumeratedValue><name>Pend</name><description>Generates an interrupt request</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SWIER51</name>
              <description>Software interrupt on line
              x+32</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SWIER49W"/>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PMR2</name>
          <displayName>D3PMR2</displayName>
          <description>EXTI D3 pending mask register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR34</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MR34</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MR35</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR41</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR48</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR49</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR50</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR51</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR52</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
            <field>
              <name>MR53</name>
              <description>D3 Pending Mask on Event input
              x+32</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="MR34"/>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR2L</name>
          <displayName>D3PCR2L</displayName>
          <description>EXTI D3 pending clear selection register
          low</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS35</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+64)/2)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS34"/>
            </field>
            <field>
              <name>PCS34</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+64)/2)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PCS34</name><usage>read-write</usage><enumeratedValue><name>DMA_CH6</name><description>DMA ch6 event selected as D3 domain pendclear source</description><value>0</value></enumeratedValue><enumeratedValue><name>DMA_CH7</name><description>DMA ch7 event selected as D3 domain pendclear source</description><value>1</value></enumeratedValue><enumeratedValue><name>LPTIM4</name><description>LPTIM4 out selected as D3 domain pendclear source</description><value>2</value></enumeratedValue><enumeratedValue><name>LPTIM5</name><description>LPTIM5 out selected as D3 domain pendclear source</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCS41</name>
              <description>D3 Pending request clear input signal
              selection on Event input x = truncate
              ((n+64)/2)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS34"/>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR2H</name>
          <displayName>D3PCR2H</displayName>
          <description>EXTI D3 pending clear selection register
          high</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS48</name>
              <description>Pending request clear input signal
              selection on Event input x= truncate
              ((n+96)/2)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PCS48</name><usage>read-write</usage><enumeratedValue><name>DMA_CH6</name><description>DMA ch6 event selected as D3 domain pendclear source</description><value>0</value></enumeratedValue><enumeratedValue><name>DMA_CH7</name><description>DMA ch7 event selected as D3 domain pendclear source</description><value>1</value></enumeratedValue><enumeratedValue><name>LPTIM4</name><description>LPTIM4 out selected as D3 domain pendclear source</description><value>2</value></enumeratedValue><enumeratedValue><name>LPTIM5</name><description>LPTIM5 out selected as D3 domain pendclear source</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PCS49</name>
              <description>Pending request clear input signal
              selection on Event input x= truncate
              ((n+96)/2)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS48"/>
            </field>
            <field>
              <name>PCS50</name>
              <description>Pending request clear input signal
              selection on Event input x= truncate
              ((n+96)/2)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS48"/>
            </field>
            <field>
              <name>PCS51</name>
              <description>Pending request clear input signal
              selection on Event input x= truncate
              ((n+96)/2)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS48"/>
            </field>
            <field>
              <name>PCS52</name>
              <description>Pending request clear input signal
              selection on Event input x= truncate
              ((n+96)/2)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS48"/>
            </field>
            <field>
              <name>PCS53</name>
              <description>Pending request clear input signal
              selection on Event input x= truncate
              ((n+96)/2)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PCS48"/>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR3</name>
          <displayName>RTSR3</displayName>
          <description>EXTI rising trigger selection
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR82</name>
              <description>Rising trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TR82</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Rising edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Rising edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TR84</name>
              <description>Rising trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR82"/>
            </field>
            <field>
              <name>TR85</name>
              <description>Rising trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR82"/>
            </field>
            <field>
              <name>TR86</name>
              <description>Rising trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR82"/>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR3</name>
          <displayName>FTSR3</displayName>
          <description>EXTI falling trigger selection
          register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR82</name>
              <description>Falling trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TR82</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Falling edge trigger is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Falling edge trigger is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TR84</name>
              <description>Falling trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR82"/>
            </field>
            <field>
              <name>TR85</name>
              <description>Falling trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR82"/>
            </field>
            <field>
              <name>TR86</name>
              <description>Falling trigger event configuration bit
              of Configurable Event input x+64</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TR82"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER3</name>
          <displayName>SWIER3</displayName>
          <description>EXTI software interrupt event
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWIER82</name>
              <description>Software interrupt on line
              x+64</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SWIER82W</name><usage>write</usage><enumeratedValue><name>Pend</name><description>Generates an interrupt request</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SWIER84</name>
              <description>Software interrupt on line
              x+64</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SWIER82W"/>
            </field>
            <field>
              <name>SWIER85</name>
              <description>Software interrupt on line
              x+64</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SWIER82W"/>
            </field>
            <field>
              <name>SWIER86</name>
              <description>Software interrupt on line
              x+64</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="SWIER82W"/>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PMR3</name>
          <displayName>D3PMR3</displayName>
          <description>EXTI D3 pending mask register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR88</name>
              <description>D3 Pending Mask on Event input
              x+64</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MR88</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR3H</name>
          <displayName>D3PCR3H</displayName>
          <description>EXTI D3 pending clear selection register
          high</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCS88</name>
              <description>D3 Pending request clear input signal
              selection on Event input x= truncate
              N+160/2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PCS88</name><usage>read-write</usage><enumeratedValue><name>DMA_CH6</name><description>DMA ch6 event selected as D3 domain pendclear source</description><value>0</value></enumeratedValue><enumeratedValue><name>DMA_CH7</name><description>DMA ch7 event selected as D3 domain pendclear source</description><value>1</value></enumeratedValue><enumeratedValue><name>LPTIM4</name><description>LPTIM4 out selected as D3 domain pendclear source</description><value>2</value></enumeratedValue><enumeratedValue><name>LPTIM5</name><description>LPTIM5 out selected as D3 domain pendclear source</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
