tinygo-org/stm32-svd/svd/stm32h747cm4.svd
      <register><name>C2IMR1</name><description>CPU2 EXTI interrupt mask register</description><addressOffset>192</addressOffset><resetValue>4290772992</resetValue><fields><field><name>MR0</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>MR0</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MR1</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR2</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR3</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR4</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR5</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR6</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR7</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR8</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR9</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR10</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR11</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR12</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR13</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR14</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR15</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR16</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR17</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR18</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR19</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR20</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR21</name><description>CPU2 interrupt mask on Configurable Event input</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR22</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR23</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR24</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR25</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR26</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR27</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR28</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR29</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR30</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR31</name><description>CPU2 interrupt mask on Direct Event input</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            </fields></register>
        <register><name>C2EMR1</name><description>CPU2 EXTI event mask register</description><addressOffset>196</addressOffset><resetValue>0</resetValue><fields><field><name>MR0</name><description>CPU2 event mask on Event input x</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>MR0</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MR1</name><description>CPU2 event mask on Event input x</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR2</name><description>CPU2 event mask on Event input x</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR3</name><description>CPU2 event mask on Event input x</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR4</name><description>CPU2 event mask on Event input x</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR5</name><description>CPU2 event mask on Event input x</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR6</name><description>CPU2 event mask on Event input x</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR7</name><description>CPU2 event mask on Event input x</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR8</name><description>CPU2 event mask on Event input x</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR9</name><description>CPU2 event mask on Event input x</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR10</name><description>CPU2 event mask on Event input x</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR11</name><description>CPU2 event mask on Event input x</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR12</name><description>CPU2 event mask on Event input x</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR13</name><description>CPU2 event mask on Event input x</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR14</name><description>CPU2 event mask on Event input x</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR15</name><description>CPU2 event mask on Event input x</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR16</name><description>CPU2 event mask on Event input x</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR17</name><description>CPU2 event mask on Event input x</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR18</name><description>CPU2 event mask on Event input x</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR19</name><description>CPU2 event mask on Event input x</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR20</name><description>CPU2 event mask on Event input x</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR21</name><description>CPU2 event mask on Event input x</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR22</name><description>CPU2 event mask on Event input x</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR23</name><description>CPU2 event mask on Event input x</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR24</name><description>CPU2 event mask on Event input x</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR25</name><description>CPU2 event mask on Event input x</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR26</name><description>CPU2 event mask on Event input x</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR27</name><description>CPU2 event mask on Event input x</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR28</name><description>CPU2 event mask on Event input x</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR29</name><description>CPU2 event mask on Event input x</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR30</name><description>CPU2 event mask on Event input x</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            <field><name>MR31</name><description>CPU2 event mask on Event input x</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR0"/>
            </field>
            </fields></register>
        <register><name>C2PR1</name><description>CPU2 EXTI pending register</description><addressOffset>200</addressOffset><resetValue>0</resetValue><fields><field><name>PR0</name><description>Configurable event input pending</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>PR0R</name><usage>read</usage><enumeratedValue><name>NotPending</name><description>No trigger request occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Selected trigger request occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PR0W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears pending bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>PR1</name><description>Configurable event input pending</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR2</name><description>Configurable event input pending</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR3</name><description>Configurable event input pending</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR4</name><description>Configurable event input pending</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR5</name><description>Configurable event input pending</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR6</name><description>Configurable event input pending</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR7</name><description>Configurable event input pending</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR8</name><description>Configurable event input pending</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR9</name><description>Configurable event input pending</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR10</name><description>Configurable event input pending</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR11</name><description>Configurable event input pending</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR12</name><description>Configurable event input pending</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR13</name><description>Configurable event input pending</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR14</name><description>Configurable event input pending</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR15</name><description>Configurable event input pending</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR16</name><description>Configurable event input pending</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR17</name><description>Configurable event input pending</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR18</name><description>Configurable event input pending</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR19</name><description>Configurable event input pending</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR20</name><description>Configurable event input pending</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            <field><name>PR21</name><description>Configurable event input pending</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR0R"/>
            <enumeratedValues derivedFrom="PR0W"/>
            </field>
            </fields></register>
        <register><name>C2IMR2</name><description>CPU2 EXTI interrupt mask register</description><addressOffset>208</addressOffset><resetValue>4294311935</resetValue><fields><field><name>MR32</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>MR32</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MR33</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR34</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR35</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR36</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR37</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR38</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR39</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR40</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR41</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR42</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR43</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR44</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR46</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
