tinygo-org/stm32-svd/svd/stm32h747cm4.svd
            <field><name>MR47</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR48</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR49</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR50</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR51</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR52</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR53</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR54</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR55</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR56</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR57</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR58</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR59</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR60</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR61</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR62</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR63</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            </fields></register>
        <register><name>C2EMR2</name><description>CPU2 EXTI event mask register</description><addressOffset>212</addressOffset><resetValue>0</resetValue><fields><field><name>MR32</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>MR32</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MR33</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR34</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR35</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR36</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR37</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR38</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR39</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR40</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR41</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR42</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR43</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR44</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR46</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR47</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR48</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR49</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR50</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR51</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR52</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR53</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR54</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR55</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR56</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR57</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR58</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR59</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR60</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR61</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR62</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            <field><name>MR63</name><description>CPU2 interrupt Mask on Direct Event input x+32</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR32"/>
            </field>
            </fields></register>
        <register><name>C2PR2</name><description>CPU2 EXTI pending register</description><addressOffset>216</addressOffset><resetValue>0</resetValue><fields><field><name>PR49</name><description>CPU2 configurable event inputs x+32 Pending bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>PR49R</name><usage>read</usage><enumeratedValue><name>NotPending</name><description>No trigger request occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Selected trigger request occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PR49W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears pending bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>PR51</name><description>CPU2 configurable event inputs x+32 Pending bit</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR49R"/>
            <enumeratedValues derivedFrom="PR49W"/>
            </field>
            </fields></register>
        <register><name>C2IMR3</name><description>CPU2 EXTI interrupt mask register</description><addressOffset>224</addressOffset><resetValue>25952255</resetValue><fields><field><name>MR64</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>MR64</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MR65</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR66</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR67</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR68</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR69</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR70</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR71</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR72</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR73</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR74</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR75</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR76</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR77</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR78</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR79</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR80</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR82</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR84</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR85</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR86</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR87</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR88</name><description>CPU2 interrupt Mask on Direct Event input x+64</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            </fields></register>
        <register><name>C2EMR3</name><description>CPU2 EXTI event mask register</description><addressOffset>228</addressOffset><resetValue>0</resetValue><fields><field><name>MR64</name><description>CPU2 event mask on Event input x+64</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>MR64</name><usage>read-write</usage><enumeratedValue><name>Masked</name><description>Interrupt request line is masked</description><value>0</value></enumeratedValue><enumeratedValue><name>Unmasked</name><description>Interrupt request line is unmasked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MR65</name><description>CPU2 event mask on Event input x+64</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR66</name><description>CPU2 event mask on Event input x+64</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR67</name><description>CPU2 event mask on Event input x+64</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR68</name><description>CPU2 event mask on Event input x+64</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR69</name><description>CPU2 event mask on Event input x+64</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR70</name><description>CPU2 event mask on Event input x+64</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR71</name><description>CPU2 event mask on Event input x+64</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR72</name><description>CPU2 event mask on Event input x+64</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR73</name><description>CPU2 event mask on Event input x+64</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR74</name><description>CPU2 event mask on Event input x+64</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR75</name><description>CPU2 event mask on Event input x+64</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR76</name><description>CPU2 event mask on Event input x+64</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR77</name><description>CPU2 event mask on Event input x+64</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR78</name><description>CPU2 event mask on Event input x+64</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR79</name><description>CPU2 event mask on Event input x+64</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR80</name><description>CPU2 event mask on Event input x+64</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR82</name><description>CPU2 event mask on Event input x+64</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR84</name><description>CPU2 event mask on Event input x+64</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR85</name><description>CPU2 event mask on Event input x+64</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR86</name><description>CPU2 event mask on Event input x+64</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR87</name><description>CPU2 event mask on Event input x+64</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            <field><name>MR88</name><description>CPU2 event mask on Event input x+64</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="MR64"/>
            </field>
            </fields></register>
        <register><name>C2PR3</name><description>CPU2 EXTI pending register</description><addressOffset>232</addressOffset><resetValue>0</resetValue><fields><field><name>PR82</name><description>CPU2 configurable event inputs x+64 Pending bit</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>PR82R</name><usage>read</usage><enumeratedValue><name>NotPending</name><description>No trigger request occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Pending</name><description>Selected trigger request occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>PR82W</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears pending bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>PR84</name><description>CPU2 configurable event inputs x+64 Pending bit</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><enumeratedValues derivedFrom="PR82R"/>
            <enumeratedValues derivedFrom="PR82W"/>
            </field>
