tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register>
          <name>AF1</name>
          <displayName>AF1</displayName>
          <description>TIM alternate function option register
          1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>ETRSEL</name>
              <description>ETR source selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <displayName>TISEL</displayName>
          <description>TIM timer input selection
          register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>TI1SEL</name>
              <description>TI1[0] to TI1[15] input
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TI2SEL</name>
              <description>TI2[0] to TI2[15] input
              selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TI3SEL</name>
              <description>TI3[0] to TI3[15] input
              selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TI4SEL</name>
              <description>TI4[0] to TI4[15] input
              selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM13">
      <name>TIM14</name>
      <baseAddress>0x40002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DMA1"><name>DMA2</name><baseAddress>1073873920</baseAddress><interrupt><name>DMA2_STR0</name><description>DMA2 Stream0</description><value>56</value></interrupt>
    <interrupt><name>DMA2_STR1</name><description>DMA2 Stream1</description><value>57</value></interrupt>
    <interrupt><name>DMA2_STR2</name><description>DMA2 Stream2</description><value>58</value></interrupt>
    <interrupt><name>DMA2_STR3</name><description>DMA2 Stream3</description><value>59</value></interrupt>
    <interrupt><name>DMA2_STR4</name><description>DMA2 Stream4</description><value>60</value></interrupt>
    <interrupt><name>DMA2_STR5</name><description>DMA2 Stream5</description><value>68</value></interrupt>
    <interrupt><name>DMA2_STR6</name><description>DMA2 Stream6</description><value>69</value></interrupt>
    <interrupt><name>DMA2_STR7</name><description>DMA2 Stream7</description><value>70</value></interrupt>
    </peripheral>
    <peripheral><name>Ethernet_DMA</name><description>Ethernet DMA</description><baseAddress>1073909760</baseAddress><registers><register><name>DMAMR</name><description>DMA mode register</description><addressOffset>0</addressOffset><resetValue>0</resetValue><fields><field><name>INTM</name><description>Interrupt Mode</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>PR</name><description>Priority ratio</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field>
            <field><name>TXPR</name><description>Transmit priority</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DA</name><description>DMA Tx or Rx Arbitration Scheme</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SWR</name><description>Software Reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMASBMR</name><description>System bus mode register</description><addressOffset>4</addressOffset><resetValue>16842752</resetValue><fields><field><name>RB</name><description>Rebuild INCRx Burst</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>MB</name><description>Mixed Burst</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>AAL</name><description>Address-Aligned Beats</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FB</name><description>Fixed Burst Length</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMAISR</name><description>Interrupt status register</description><addressOffset>8</addressOffset><resetValue>0</resetValue><fields><field><name>MACIS</name><description>MAC Interrupt Status</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MTLIS</name><description>MTL Interrupt Status</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DC0IS</name><description>DMA Channel Interrupt Status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMADSR</name><description>Debug status register</description><addressOffset>12</addressOffset><resetValue>0</resetValue><fields><field><name>TPS0</name><description>DMA Channel Transmit Process State</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>RPS0</name><description>DMA Channel Receive Process State</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>AXWHSTS</name><description>AHB Master Write Channel</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMACCR</name><description>Channel control register</description><addressOffset>256</addressOffset><resetValue>0</resetValue><fields><field><name>DSL</name><description>Descriptor Skip Length</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>PBLX8</name><description>8xPBL mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MSS</name><description>Maximum Segment Size</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field>
            </fields></register>
        <register><name>DMACTxCR</name><description>Channel transmit control register</description><addressOffset>260</addressOffset><resetValue>0</resetValue><fields><field><name>TXPBL</name><description>Transmit Programmable Burst Length</description><bitOffset>16</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>TSE</name><description>TCP Segmentation Enabled</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OSF</name><description>Operate on Second Packet</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ST</name><description>Start or Stop Transmission Command</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMACRxCR</name><description>Channel receive control register</description><addressOffset>264</addressOffset><resetValue>0</resetValue><fields><field><name>RPF</name><description>DMA Rx Channel Packet Flush</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RXPBL</name><description>Receive Programmable Burst Length</description><bitOffset>16</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>RBSZ</name><description>Receive Buffer size</description><bitOffset>1</bitOffset><bitWidth>14</bitWidth></field>
            <field><name>SR</name><description>Start or Stop Receive</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMACTxDLAR</name><description>Channel Tx descriptor list address register</description><addressOffset>276</addressOffset><resetValue>0</resetValue><fields><field><name>TDESLA</name><description>Start of Transmit List</description><bitOffset>2</bitOffset><bitWidth>30</bitWidth></field>
            </fields></register>
        <register><name>DMACRxDLAR</name><description>Channel Rx descriptor list address register</description><addressOffset>284</addressOffset><resetValue>0</resetValue><fields><field><name>RDESLA</name><description>Start of Receive List</description><bitOffset>2</bitOffset><bitWidth>30</bitWidth></field>
            </fields></register>
        <register><name>DMACTxDTPR</name><description>Channel Tx descriptor tail pointer register</description><addressOffset>288</addressOffset><resetValue>0</resetValue><fields><field><name>TDT</name><description>Transmit Descriptor Tail Pointer</description><bitOffset>2</bitOffset><bitWidth>30</bitWidth></field>
            </fields></register>
        <register><name>DMACRxDTPR</name><description>Channel Rx descriptor tail pointer register</description><addressOffset>296</addressOffset><resetValue>0</resetValue><fields><field><name>RDT</name><description>Receive Descriptor Tail Pointer</description><bitOffset>2</bitOffset><bitWidth>30</bitWidth></field>
            </fields></register>
        <register><name>DMACTxRLR</name><description>Channel Tx descriptor ring length register</description><addressOffset>300</addressOffset><resetValue>0</resetValue><fields><field><name>TDRL</name><description>Transmit Descriptor Ring Length</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>DMACRxRLR</name><description>Channel Rx descriptor ring length register</description><addressOffset>304</addressOffset><resetValue>0</resetValue><fields><field><name>RDRL</name><description>Receive Descriptor Ring Length</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>DMACIER</name><description>Channel interrupt enable register</description><addressOffset>308</addressOffset><resetValue>0</resetValue><fields><field><name>NIE</name><description>Normal Interrupt Summary Enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AIE</name><description>Abnormal Interrupt Summary Enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CDEE</name><description>Context Descriptor Error Enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBEE</name><description>Fatal Bus Error Enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ERIE</name><description>Early Receive Interrupt Enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ETIE</name><description>Early Transmit Interrupt Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RWTE</name><description>Receive Watchdog Timeout Enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RSE</name><description>Receive Stopped Enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RBUE</name><description>Receive Buffer Unavailable Enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RIE</name><description>Receive Interrupt Enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TBUE</name><description>Transmit Buffer Unavailable Enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXSE</name><description>Transmit Stopped Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIE</name><description>Transmit Interrupt Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMACRxIWTR</name><description>Channel Rx interrupt watchdog timer register</description><addressOffset>312</addressOffset><resetValue>0</resetValue><fields><field><name>RWT</name><description>Receive Interrupt Watchdog Timer Count</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>DMACCATxDR</name><description>Channel current application transmit descriptor register</description><addressOffset>324</addressOffset><resetValue>0</resetValue><fields><field><name>CURTDESAPTR</name><description>Application Transmit Descriptor Address Pointer</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>DMACCARxDR</name><description>Channel current application receive descriptor register</description><addressOffset>332</addressOffset><resetValue>0</resetValue><fields><field><name>CURRDESAPTR</name><description>Application Receive Descriptor Address Pointer</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>DMACCATxBR</name><description>Channel current application transmit buffer register</description><addressOffset>340</addressOffset><resetValue>0</resetValue><fields><field><name>CURTBUFAPTR</name><description>Application Transmit Buffer Address Pointer</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>DMACCARxBR</name><description>Channel current application receive buffer register</description><addressOffset>348</addressOffset><resetValue>0</resetValue><fields><field><name>CURRBUFAPTR</name><description>Application Receive Buffer Address Pointer</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>DMACSR</name><description>Channel status register</description><addressOffset>352</addressOffset><resetValue>0</resetValue><fields><field><name>REB</name><description>Rx DMA Error Bits</description><bitOffset>19</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>TEB</name><description>Tx DMA Error Bits</description><bitOffset>16</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>NIS</name><description>Normal Interrupt Summary</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AIS</name><description>Abnormal Interrupt Summary</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CDE</name><description>Context Descriptor Error</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBE</name><description>Fatal Bus Error</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ERI</name><description>Early Receive Interrupt</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ETI</name><description>Early Transmit Interrupt</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RWT</name><description>Receive Watchdog Timeout</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RPS</name><description>Receive Process Stopped</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RBU</name><description>Receive Buffer Unavailable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RI</name><description>Receive Interrupt</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TBU</name><description>Transmit Buffer Unavailable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TPS</name><description>Transmit Process Stopped</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TI</name><description>Transmit Interrupt</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>DMACMFCR</name><description>Channel missed frame count register</description><addressOffset>364</addressOffset><resetValue>0</resetValue><fields><field><name>MFCO</name><description>Overflow status of the MFC Counter</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MFC</name><description>Dropped Packet Counters</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field>
            </fields></register>
        </registers></peripheral>
    <peripheral><name>Ethernet_MTL</name><description>Ethernet MTL</description><baseAddress>1073908736</baseAddress><registers><register><name>MTLOMR</name><description>Operating mode Register</description><addressOffset>0</addressOffset><resetValue>0</resetValue><fields><field><name>CNTCLR</name><description>Counters Reset</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CNTPRST</name><description>Counters Preset</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DTXSTS</name><description>Drop Transmit Status</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>MTLISR</name><description>Interrupt status Register</description><addressOffset>32</addressOffset><resetValue>0</resetValue><fields><field><name>Q0IS</name><description>Queue interrupt status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>MTLTxQOMR</name><description>Tx queue operating mode Register</description><addressOffset>256</addressOffset><resetValue>458760</resetValue><fields><field><name>TQS</name><description>Transmit Queue Size</description><bitOffset>16</bitOffset><bitWidth>9</bitWidth></field>
            <field><name>TTC</name><description>Transmit Threshold Control</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>TXQEN</name><description>Transmit Queue Enable</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>TSF</name><description>Transmit Store and Forward</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FTQ</name><description>Flush Transmit Queue</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>MTLTxQUR</name><description>Tx queue underflow register</description><addressOffset>260</addressOffset><resetValue>0</resetValue><fields><field><name>UFCNTOVF</name><description>Overflow Bit for Underflow Packet Counter</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UFFRMCNT</name><description>Underflow Packet Counter</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field>
            </fields></register>
        <register><name>MTLTxQDR</name><description>Tx queue debug Register</description><addressOffset>264</addressOffset><resetValue>0</resetValue><fields><field><name>STXSTSF</name><description>Number of Status Words in Tx Status FIFO of Queue</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>PTXQ</name><description>Number of Packets in the Transmit Queue</description><bitOffset>16</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>TXSTSFSTS</name><description>MTL Tx Status FIFO Full Status</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXQSTS</name><description>MTL Tx Queue Not Empty Status</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TWCSTS</name><description>MTL Tx Queue Write Controller Status</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TRCSTS</name><description>MTL Tx Queue Read Controller Status</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>TXQPAUSED</name><description>Transmit Queue in Pause</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>MTLQICSR</name><description>Queue interrupt control status Register</description><addressOffset>300</addressOffset><resetValue>0</resetValue><fields><field><name>RXOIE</name><description>Receive Queue Overflow Interrupt Enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RXOVFIS</name><description>Receive Queue Overflow Interrupt Status</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXUIE</name><description>Transmit Queue Underflow Interrupt Enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXUNFIS</name><description>Transmit Queue Underflow Interrupt Status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>MTLRxQOMR</name><description>Rx queue operating mode register</description><addressOffset>304</addressOffset><resetValue>7340032</resetValue><fields><field><name>RQS</name><description>Receive Queue Size</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>RFD</name><description>Threshold for Deactivating Flow Control</description><bitOffset>14</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>RFA</name><description>Threshold for Activating Flow Control</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>EHFC</name><description>Enable Hardware Flow Control</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DIS_TCP_EF</name><description>Disable Dropping of TCP</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RSF</name><description>Receive Queue Store and Forward</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FEP</name><description>Forward Error Packets</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FUP</name><description>Forward Undersized Good Packets</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RTC</name><description>Receive Queue Threshold Control</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>MTLRxQMPOCR</name><description>Rx queue missed packet and overflow counter register</description><addressOffset>308</addressOffset><resetValue>0</resetValue><fields><field><name>MISCNTOVF</name><description>Missed Packet Counter Overflow Bit</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MISPKTCNT</name><description>Missed Packet Counter</description><bitOffset>16</bitOffset><bitWidth>11</bitWidth></field>
            <field><name>OVFCNTOVF</name><description>Overflow Counter Overflow Bit</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OVFPKTCNT</name><description>Overflow Packet Counter</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field>
            </fields></register>
