tinygo-org/stm32-svd/svd/stm32h747cm4.svd
        <register><name>MTLRxQDR</name><description>Rx queue debug register</description><addressOffset>312</addressOffset><resetValue>0</resetValue><fields><field><name>PRXQ</name><description>Number of Packets in Receive Queue</description><bitOffset>16</bitOffset><bitWidth>14</bitWidth></field>
            <field><name>RXQSTS</name><description>MTL Rx Queue Fill-Level Status</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>RRCSTS</name><description>MTL Rx Queue Read Controller State</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>RWCSTS</name><description>MTL Rx Queue Write Controller Active Status</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        </registers></peripheral>
    <peripheral><name>DSIHOST</name><description>MIPI DSI Host</description><groupName>DSIHOST</groupName><baseAddress>1342177280</baseAddress><addressBlock><offset>0</offset><size>1280</size><usage>registers</usage></addressBlock><interrupt><name>DSI</name><description>DSI Host global interrupt</description><value>123</value></interrupt>
    <registers><register><name>VR</name><description>DSI Host version register</description><addressOffset>0</addressOffset><access>read-only</access><resetValue>825438250</resetValue><fields><field><name>VERSION</name><description>Version of the DSI Host</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>CR</name><description>DSI Host control register</description><addressOffset>4</addressOffset><resetValue>0</resetValue><fields><field><name>EN</name><description>Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>CCR</name><description>DSI Host clock control register</description><addressOffset>8</addressOffset><resetValue>0</resetValue><fields><field><name>TOCKDIV</name><description>Timeout clock division</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>TXECKDIV</name><description>TX escape clock division</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>LVCIDR</name><description>DSI Host LTDC VCID register</description><addressOffset>12</addressOffset><resetValue>0</resetValue><fields><field><name>VCID</name><description>Virtual channel ID</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>LCOLCR</name><description>DSI Host LTDC color coding register</description><addressOffset>16</addressOffset><resetValue>0</resetValue><fields><field><name>LPE</name><description>Loosely packet enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>COLC</name><description>Color coding</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            </fields></register>
        <register><name>LPCR</name><description>DSI Host LTDC polarity configuration register</description><addressOffset>20</addressOffset><resetValue>0</resetValue><fields><field><name>HSP</name><description>HSYNC polarity</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>VSP</name><description>VSYNC polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DEP</name><description>Data enable polarity</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>LPMCR</name><description>DSI Host low-power mode configuration register</description><addressOffset>24</addressOffset><resetValue>0</resetValue><fields><field><name>LPSIZE</name><description>Largest packet size</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>VLPSIZE</name><description>VACT largest packet size</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>PCR</name><description>DSI Host protocol configuration register</description><addressOffset>44</addressOffset><resetValue>0</resetValue><fields><field><name>CRCRXE</name><description>CRC reception enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ECCRXE</name><description>ECC reception enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BTAE</name><description>Bus</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ETRXE</name><description>EoTp reception enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ETTXE</name><description>EoTp transmission enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>GVCIDR</name><description>DSI Host generic VCID register</description><addressOffset>48</addressOffset><resetValue>0</resetValue><fields><field><name>VCID</name><description>Virtual channel ID</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>MCR</name><description>DSI Host mode configuration register</description><addressOffset>52</addressOffset><resetValue>1</resetValue><fields><field><name>CMDM</name><description>Command mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>VMCR</name><description>DSI Host video mode configuration register</description><addressOffset>56</addressOffset><resetValue>0</resetValue><fields><field><name>PGO</name><description>Pattern generator orientation</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PGM</name><description>Pattern generator mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PGE</name><description>Pattern generator enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPCE</name><description>Low-power command enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBTAAE</name><description>Frame bus-turn-around acknowledge enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPHFPE</name><description>Low-power horizontal front-porch enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPHBPE</name><description>Low-power horizontal back-porch enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVAE</name><description>Low-power vertical active enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVFPE</name><description>Low-power vertical front-porch enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVBPE</name><description>Low-power vertical back-porch enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVSAE</name><description>Low-power vertical sync active enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>VMT</name><description>Video mode type</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>VPCR</name><description>DSI Host video packet configuration register</description><addressOffset>60</addressOffset><resetValue>0</resetValue><fields><field><name>VPSIZE</name><description>Video packet size</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field>
            </fields></register>
        <register><name>VCCR</name><description>DSI Host video chunks configuration register</description><addressOffset>64</addressOffset><resetValue>0</resetValue><fields><field><name>NUMC</name><description>Number of chunks</description><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field>
            </fields></register>
        <register><name>VNPCR</name><description>DSI Host video null packet configuration register</description><addressOffset>68</addressOffset><resetValue>0</resetValue><fields><field><name>NPSIZE</name><description>Null packet size</description><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field>
            </fields></register>
        <register><name>VHSACR</name><description>DSI Host video HSA configuration register</description><addressOffset>72</addressOffset><resetValue>0</resetValue><fields><field><name>HSA</name><description>Horizontal synchronism active duration</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>VHBPCR</name><description>DSI Host video HBP configuration register</description><addressOffset>76</addressOffset><resetValue>0</resetValue><fields><field><name>HBP</name><description>Horizontal back-porch duration</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>VLCR</name><description>DSI Host video line configuration register</description><addressOffset>80</addressOffset><resetValue>0</resetValue><fields><field><name>HLINE</name><description>Horizontal line duration</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field>
            </fields></register>
        <register><name>VVSACR</name><description>DSI Host video VSA configuration register</description><addressOffset>84</addressOffset><resetValue>0</resetValue><fields><field><name>VSA</name><description>Vertical synchronism active duration</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>VVBPCR</name><description>DSI Host video VBP configuration register</description><addressOffset>88</addressOffset><resetValue>0</resetValue><fields><field><name>VBP</name><description>Vertical back-porch duration</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>VVFPCR</name><description>DSI Host video VFP configuration register</description><addressOffset>92</addressOffset><resetValue>0</resetValue><fields><field><name>VFP</name><description>Vertical front-porch duration</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>VVACR</name><description>DSI Host video VA configuration register</description><addressOffset>96</addressOffset><resetValue>0</resetValue><fields><field><name>VA</name><description>Vertical active duration</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field>
            </fields></register>
        <register><name>LCCR</name><description>DSI Host LTDC command configuration register</description><addressOffset>100</addressOffset><resetValue>0</resetValue><fields><field><name>CMDSIZE</name><description>Command size</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>CMCR</name><description>DSI Host command mode configuration register</description><addressOffset>104</addressOffset><resetValue>0</resetValue><fields><field><name>MRDPS</name><description>Maximum read packet size</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DLWTX</name><description>DCS long write transmission</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DSR0TX</name><description>DCS short read zero parameter transmission</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DSW1TX</name><description>DCS short read one parameter transmission</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DSW0TX</name><description>DCS short write zero parameter transmission</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GLWTX</name><description>Generic long write transmission</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GSR2TX</name><description>Generic short read two parameters transmission</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GSR1TX</name><description>Generic short read one parameters transmission</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GSR0TX</name><description>Generic short read zero parameters transmission</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GSW2TX</name><description>Generic short write two parameters transmission</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GSW1TX</name><description>Generic short write one parameters transmission</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GSW0TX</name><description>Generic short write zero parameters transmission</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ARE</name><description>Acknowledge request enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TEARE</name><description>Tearing effect acknowledge request enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>GHCR</name><description>DSI Host generic header configuration register</description><addressOffset>108</addressOffset><resetValue>0</resetValue><fields><field><name>WCMSB</name><description>WordCount MSB</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>WCLSB</name><description>WordCount LSB</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>VCID</name><description>Channel</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>DT</name><description>Type</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            </fields></register>
        <register><name>GPDR</name><description>DSI Host generic payload data register</description><addressOffset>112</addressOffset><resetValue>0</resetValue><fields><field><name>DATA4</name><description>Payload byte 4</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DATA3</name><description>Payload byte 3</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DATA2</name><description>Payload byte 2</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DATA1</name><description>Payload byte 1</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>GPSR</name><description>DSI Host generic packet status register</description><addressOffset>116</addressOffset><resetValue>21</resetValue><fields><field><name>RCB</name><description>Read command busy</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PRDFF</name><description>Payload read FIFO full</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PRDFE</name><description>Payload read FIFO empty</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PWRFF</name><description>Payload write FIFO full</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PWRFE</name><description>Payload write FIFO empty</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CMDFF</name><description>Command FIFO full</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CMDFE</name><description>Command FIFO empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>TCCR0</name><description>DSI Host timeout counter configuration register 0</description><addressOffset>120</addressOffset><resetValue>0</resetValue><fields><field><name>HSTX_TOCNT</name><description>High-speed transmission timeout counter</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>LPRX_TOCNT</name><description>Low-power reception timeout counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>TCCR1</name><description>DSI Host timeout counter configuration register 1</description><addressOffset>124</addressOffset><resetValue>0</resetValue><fields><field><name>HSRD_TOCNT</name><description>High-speed read timeout counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>TCCR2</name><description>DSI Host timeout counter configuration register 2</description><addressOffset>128</addressOffset><resetValue>0</resetValue><fields><field><name>LPRD_TOCNT</name><description>Low-power read timeout counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>TCCR3</name><description>DSI Host timeout counter configuration register 3</description><addressOffset>132</addressOffset><resetValue>0</resetValue><fields><field><name>PM</name><description>Presp mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HSWR_TOCNT</name><description>High-speed write timeout counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>TCCR4</name><description>DSI Host timeout counter configuration register 4</description><addressOffset>136</addressOffset><resetValue>0</resetValue><fields><field><name>LPWR_TOCNT</name><description>Low-power write timeout counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>TCCR5</name><description>DSI Host timeout counter configuration register 5</description><addressOffset>140</addressOffset><resetValue>0</resetValue><fields><field><name>BTA_TOCNT</name><description>Bus-turn-around timeout counter</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            </fields></register>
        <register><name>CLCR</name><description>DSI Host clock lane configuration register</description><addressOffset>148</addressOffset><resetValue>0</resetValue><fields><field><name>ACR</name><description>Automatic clock lane control</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DPCC</name><description>D-PHY clock control</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>CLTCR</name><description>DSI Host clock lane timer configuration register</description><addressOffset>152</addressOffset><resetValue>0</resetValue><fields><field><name>HS2LP_TIME</name><description>High-speed to low-power time</description><bitOffset>16</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>LP2HS_TIME</name><description>Low-power to high-speed time</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>DLTCR</name><description>DSI Host data lane timer configuration register</description><addressOffset>156</addressOffset><resetValue>0</resetValue><fields><field><name>HS2LP_TIME</name><description>High-speed to low-power time</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>LP2HS_TIME</name><description>Low-power to high-speed time</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>MRD_TIME</name><description>Maximum read time</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field>
            </fields></register>
        <register><name>PCTLR</name><description>DSI Host PHY control register</description><addressOffset>160</addressOffset><resetValue>0</resetValue><fields><field><name>CKE</name><description>Clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DEN</name><description>Digital enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>PCONFR</name><description>DSI Host PHY configuration register</description><addressOffset>164</addressOffset><resetValue>1</resetValue><fields><field><name>SW_TIME</name><description>Stop wait time</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>NL</name><description>Number of lanes</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>PUCR</name><description>DSI Host PHY ULPS control register</description><addressOffset>168</addressOffset><resetValue>0</resetValue><fields><field><name>UEDL</name><description>ULPS exit on data lane</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>URDL</name><description>ULPS request on data lane</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UECL</name><description>ULPS exit on clock lane</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>URCL</name><description>ULPS request on clock lane</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>PTTCR</name><description>DSI Host PHY TX triggers configuration register</description><addressOffset>172</addressOffset><resetValue>0</resetValue><fields><field><name>TX_TRIG</name><description>Transmission trigger</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            </fields></register>
        <register><name>PSR</name><description>DSI Host PHY status register</description><addressOffset>176</addressOffset><resetValue>5416</resetValue><fields><field><name>UAN1</name><description>ULPS active not lane 1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PSS1</name><description>PHY stop state lane 1</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RUE0</name><description>RX ULPS escape lane 0</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UAN0</name><description>ULPS active not lane 1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PSS0</name><description>PHY stop state lane 0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UANC</name><description>ULPS active not clock lane</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PSSC</name><description>PHY stop state clock lane</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PD</name><description>PHY direction</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
